src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <attributes>
    <name>ИдентификаторИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонфигурации</name>
    <type>
      <types>CatalogRef.ВидыКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРазмещения</name>
    <type>
      <types>EnumRef.ВариантыРазмещенияИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПоддержки</name>
    <type>
      <types>EnumRef.СтатусыПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИБ</name>
    <type>
      <types>EnumRef.СтатусыИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКаталогИБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверИБ</name>
    <type>
      <types>CatalogRef.Серверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСУБД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверСУБД</name>
    <type>
      <types>CatalogRef.Серверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияТехнологическойПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииТехнологическойПлатформы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонУведомленияПодключение</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыОбъектовИБ/ТипыОбъектовИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовИБ</name>
  <enumValues>
    <name>Конфигурация</name>
  </enumValues>
  <enumValues>
    <name>Подсистема</name>
  </enumValues>
  <enumValues>
    <name>РасширениеКонфигурации</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВариантыРазмещенияИнформационныхБаз/ВариантыРазмещенияИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРазмещенияИнформационныхБаз</name>
  <enumValues>
    <name>Файловый</name>
  </enumValues>
  <enumValues>
    <name>КлиентСерверный</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ИнформационныеБазы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ИнформационнаяБаза = Объект.Ссылка;
	
	УстановитьПараметрыДинамическихСписков(ТекущаяДата, ИнформационнаяБаза);
	
	АктуальныйСостав = ОтветственныеЛица.ПолучитьАктуальныйСостав(ТекущаяДата, Объект.Организация, ИнформационнаяБаза);
	СоставОтветственныхЛиц.Загрузить(АктуальныйСостав); 
	
	АктуальныйСоставПодключение = ОтветственныеЛица.ПолучитьАктуальныйСоставПодключение(ТекущаяДата, Объект.Организация, ИнформационнаяБаза);
	СоставОтветственныхЗаПодключение.Загрузить(АктуальныйСоставПодключение);
	
	Настройки = КонтрольРелизов.ПолучитьНастройкиИБ(ИнформационнаяБаза);
	НастройкиКонтроляРелизов.Загрузить(Настройки);
	
	ОбщийСоставОтветственныхЗаРасширения.Загрузить(ОтветственныеЛица.ПолучитьВсехОтветственныхЗаРасширенияИБ(ИнформационнаяБаза));
	СоставОтветственныхЗаРасширение.Очистить();
	ТекущееРасширениеДляОтветственных = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ИнформационнаяБаза = Объект.Ссылка;
	
	НовыйСостав = СоставОтветственныхЛиц.Выгрузить();
	ОтветственныеЛица.ЗаписатьСостав(ТекущаяДата, НовыйСостав, Объект.Организация, ИнформационнаяБаза); 
	
	НовыйСоставПодключение = СоставОтветственныхЗаПодключение.Выгрузить();
	ОтветственныеЛица.ЗаписатьСоставПодключение(ТекущаяДата, НовыйСоставПодключение, Объект.Организация, ИнформационнаяБаза); 
	
	ОбщийСоставЗаРасширение = ОбщийСоставОтветственныхЗаРасширения.Выгрузить();
	ЗаписатьОбщийСоставОтветственныхЗаРасширения(Неопределено, ОбщийСоставЗаРасширение, ИнформационнаяБаза);
	
	НовыеНастройки = НастройкиКонтроляРелизов.Выгрузить();
	КонтрольРелизов.ЗаписатьНастройкиИБ(НовыеНастройки, ИнформационнаяБаза);
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбщийСоставОтветственныхЗаРасширения(ДатаРасчета, ОбщийСостав, ИнформационнаяБаза)
	
	ОтветственныеЛица.ЗаписатьВсехОтветственныхЗаРасширенияИБ(
		ОбщийСостав, 
		ИнформационнаяБаза, 
		Объект.Организация
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПрочитатьНастройкуКонтроля();	
	//НастроитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ВерсияПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Версия) Тогда 
		Объект.ВидКонфигурации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Версия, "ВидКонфигурации");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПриИзменении(Элемент)
	ВерсияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВариантРазмещенияПриИзменении(Элемент)
	НастроитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура СоставОтветственныхЛицОтветственныйПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставОтветственныхЛиц.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	КонтактныеДанные = ОтветственныеЛица.ПолучитьКонтактныеДанные(ТекущиеДанные.Ответственный);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, КонтактныеДанные);
	ТекущиеДанные.Источник = "ИнформационнаяБаза";
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьСоставОтветственныхЗаРасширение()
	
	ТекущиеДанные = Элементы.УстановленныеРасширенияКонфигурации.ТекущиеДанные;
	СинхронизироватьСоставОтветственныхЗаРасширениеНаСервере(ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьСоставОтветственныхЗаРасширениеНаСервере(Знач ТекущиеДанные)
		
	Если ТекущиеДанные = Неопределено Тогда 
		Если ЗначениеЗаполнено(ТекущееРасширениеДляОтветственных) Тогда
			СохранитьИзмененияВОбщийСостав(ТекущееРасширениеДляОтветственных);
		КонецЕсли;
		СоставОтветственныхЗаРасширение.Очистить();
		ТекущееРасширениеДляОтветственных = Неопределено;
		Возврат;
	КонецЕсли;
	
	НовоеРасширение = ТекущиеДанные.РасширениеКонфигурации;
	
	Если ЗначениеЗаполнено(ТекущееРасширениеДляОтветственных) И ТекущееРасширениеДляОтветственных <> НовоеРасширение Тогда
		СохранитьИзмененияВОбщийСостав(ТекущееРасширениеДляОтветственных);
	КонецЕсли;
	
	ЗагрузитьСоставИзОбщегоСписка(НовоеРасширение);
	ТекущееРасширениеДляОтветственных = НовоеРасширение;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияВОбщийСостав(Расширение)
	
	Если НЕ ЗначениеЗаполнено(Расширение) Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПоРасширению = ОбщийСоставОтветственныхЗаРасширения.НайтиСтроки(Новый Структура("РасширениеКонфигурации", Расширение));
	
	Для Каждого СтрокаОтбора Из ОтборПоРасширению Цикл
		ОбщийСоставОтветственныхЗаРасширения.Удалить(СтрокаОтбора);
	КонецЦикла;
	
	ТекущийСостав = СоставОтветственныхЗаРасширение.Выгрузить();
	
	Для Каждого СтрокаСостава Из ТекущийСостав Цикл
		НоваяСтрока = ОбщийСоставОтветственныхЗаРасширения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСостава);
		НоваяСтрока.РасширениеКонфигурации = Расширение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСоставИзОбщегоСписка(Расширение)
	
	СоставОтветственныхЗаРасширение.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Расширение) Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПоРасширению = ОбщийСоставОтветственныхЗаРасширения.НайтиСтроки(Новый Структура("РасширениеКонфигурации", Расширение));
	
	Для Каждого СтрокаСостава Из ОтборПоРасширению Цикл
		НоваяСтрока = СоставОтветственныхЗаРасширение.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСостава);
	КонецЦикла;
	
КонецПроцедуры



&НаКлиенте
Процедура СоставОтветственныхЗаРасширениеПриИзменении(Элемент) 
	
	ТекущиеДанные = Элементы.СоставОтветственныхЗаРасширение.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	КонтактныеДанные = ОтветственныеЛица.ПолучитьКонтактныеДанные(ТекущиеДанные.Ответственный);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, КонтактныеДанные);
	ТекущиеДанные.Источник = "Расширение";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкуКонтроля(Элемент)

	ТекущиеДанные = ПолучитьТекущиеДанныеОбъектаКонтроля();
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъектаИБ = ТекущиеДанные.ТипОбъектаИБ;
	ОбъектИБ = ТекущиеДанные.ОбъектИБ;
	
	Модифицированность = Истина;
	
	НастройкиСтроки = НайтиНастройкиПоТипуИОбъекту(НастройкиКонтроляРелизов, ТипОбъектаИБ, ОбъектИБ);
	Если НастройкиСтроки.Количество() = 0 Тогда
		НастройкиОбъекта = НастройкиКонтроляРелизов.Добавить();
		НастройкиОбъекта.ТипОбъектаИБ = ТипОбъектаИБ;
		НастройкиОбъекта.ОбъектИБ = ОбъектИБ;
		
		НастройкиОбъекта.РекомендуемыйСрокУстановкиВДнях = 7;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОбъекта, "РекомендуемыйСрокУстановкиВДнях");
	Иначе
		НастройкиОбъекта = НастройкиСтроки[0];
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НастройкиОбъекта, ЭтотОбъект);
	
	НастроитьЭлементыФормы();

КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
		
	ПрочитатьНастройкуКонтроля();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьНастройкуКонтроля()
	
	ТекущиеДанные = ПолучитьТекущиеДанныеОбъектаКонтроля();
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъектаИБ = ТекущиеДанные.ТипОбъектаИБ;
	ОбъектИБ = ТекущиеДанные.ОбъектИБ;
	
	НастройкиОбъекта = ПолучитьНастройкиДляОбъектаКонтроля(ТипОбъектаИБ, ОбъектИБ);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОбъекта);
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставОтветственныхЗаПодключение

&НаКлиенте
Процедура СоставОтветственныхЗаПодключениеПриИзменении(Элемент) 
	
	ТекущиеДанные = Элементы.СоставОтветственныхЗаПодключение.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	КонтактныеДанные = ОтветственныеЛица.ПолучитьКонтактныеДанные(ТекущиеДанные.Ответственный);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, КонтактныеДанные);
	ТекущиеДанные.Источник = "ИнформационнаяБаза";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийДинамическихСписковФормы

&НаКлиенте
Процедура УстановленныеПодсистемыПриАктивизацииСтроки(Элемент)
	
	ПрочитатьНастройкуКонтроля();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановленныеРасширенияКонфигурацииПриАктивизацииСтроки(Элемент)
	
	ПрочитатьНастройкуКонтроля();
	СинхронизироватьСоставОтветственныхЗаРасширение();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыДинамическихСписков(Период, ИнформационнаяБаза) 
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(УстановленныеПодсистемы, "Период", Период);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(УстановленныеПодсистемы, "ИБ", ИнформационнаяБаза);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(УстановленныеРасширенияКонфигурации, "Период", Период);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(УстановленныеРасширенияКонфигурации, "ИБ", ИнформационнаяБаза);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНастройкиДляОбъектаКонтроля(ТипОбъектаИБ, ОбъектИБ)
	
	НастройкиОбъекта = СоздатьСтруктуруНастроекПоУмолчанию();
	
	НастройкиСтроки = НайтиНастройкиПоТипуИОбъекту(НастройкиКонтроляРелизов, ТипОбъектаИБ, ОбъектИБ);
	Если НастройкиСтроки.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(НастройкиОбъекта, НастройкиСтроки[0]);
	КонецЕсли;
	
	Возврат НастройкиОбъекта;
	
КонецФункции

&НаКлиенте
Функция НайтиНастройкиПоТипуИОбъекту(ТаблицаНастроек, ТипОбъектаИБ, ОбъектИБ)
	Отбор = СоздатьДанныеОбъектаКонтроля(ТипОбъектаИБ, ОбъектИБ);
	Возврат ТаблицаНастроек.НайтиСтроки(Отбор);
КонецФункции

&НаКлиенте
Функция СоздатьСтруктуруНастроекПоУмолчанию()
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("КонтрольАктивен", Ложь);
	СтруктураНастроек.Вставить("ШаблонУведомления", Неопределено);
	СтруктураНастроек.Вставить("РекомендуемыйСрокУстановкиВДнях", 0);
	СтруктураНастроек.Вставить("ОтправлятьПовторныеУведомления", Ложь);
	СтруктураНастроек.Вставить("ШаблонПовторногоУведомления", Неопределено);
	СтруктураНастроек.Вставить("ИнтервалПовторныхУведомленийВДнях", 0);
	СтруктураНастроек.Вставить("МаксимальноеКоличествоПовторов", 0);
	Возврат СтруктураНастроек;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТекущиеДанныеОбъектаКонтроля()
	
	ТекущаяСтраница = Элементы.Страницы.ТекущаяСтраница.Имя;
	
	Если ТекущаяСтраница = "СтраницаКарточкаИБ" Тогда
		
		Возврат СоздатьДанныеОбъектаКонтроля(
			ПредопределенноеЗначение("Перечисление.ТипыОбъектовИБ.Конфигурация"),
			Объект.ВидКонфигурации);	
	ИначеЕсли ТекущаяСтраница = "СтраницаПодсистемы" Тогда
		
		ТекущиеДанные = Элементы.УстановленныеПодсистемы.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда 
			Возврат Неопределено; 
		КонецЕсли;
		
		Возврат СоздатьДанныеОбъектаКонтроля(
			ПредопределенноеЗначение("Перечисление.ТипыОбъектовИБ.Подсистема"),
			ТекущиеДанные.Подсистема);	
	ИначеЕсли ТекущаяСтраница = "СтраницаРасширения" Тогда
		
		ТекущиеДанные = Элементы.УстановленныеРасширенияКонфигурации.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда 
			Возврат Неопределено; 
		КонецЕсли;
		
		Возврат СоздатьДанныеОбъектаКонтроля(
			ПредопределенноеЗначение("Перечисление.ТипыОбъектовИБ.РасширениеКонфигурации"),
			ТекущиеДанные.РасширениеКонфигурации);	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция СоздатьДанныеОбъектаКонтроля(ТипОбъектаИБ, ОбъектИБ)	
	Возврат Новый Структура("ТипОбъектаИБ, ОбъектИБ", ТипОбъектаИБ, ОбъектИБ);	
КонецФункции

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	
	ЭтоСервернаяИБ = (Объект.ВариантРазмещения = ПредопределенноеЗначение("Перечисление.ВариантыРазмещенияИнформационныхБаз.КлиентСерверный"));
	
	Элементы.ИмяКаталогИБ.Заголовок = ?(ЭтоСервернаяИБ, "Имя ИБ", "Каталог ИБ");
	Элементы.СерверИБ.Видимость = ЭтоСервернаяИБ;
	
	ПрефиксыЭлементов = ПолучитьПрефиксыЭлементовФормы();
	Для Каждого Префикс Из ПрефиксыЭлементов Цикл
		НастроитьЭлементыНастройки(Префикс, КонтрольАктивен, ОтправлятьПовторныеУведомления);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПрефиксыЭлементовФормы()
	
	Префиксы = Новый Массив;
	Префиксы.Добавить("");
	Префиксы.Добавить("Подсистема");
	Префиксы.Добавить("РасширениеКонфигурации");
	
	Возврат Префиксы;
КонецФункции

&НаКлиенте
Процедура НастроитьЭлементыНастройки(Префикс, КонтрольАктивен, ОтправлятьПовторныеУведомления)
	
	Элементы[Префикс + "ШаблонУведомления"].ТолькоПросмотр = НЕ КонтрольАктивен;
	Элементы[Префикс + "ОтправлятьПовторныеУведомления"].ТолькоПросмотр = НЕ КонтрольАктивен;
	Элементы[Префикс + "РекомендуемыйСрокУстановкиВДнях"].ТолькоПросмотр = НЕ КонтрольАктивен;
	Элементы[Префикс + "ШаблонПовторногоУведомления"].ТолькоПросмотр = НЕ (КонтрольАктивен И ОтправлятьПовторныеУведомления);
	Элементы[Префикс + "ИнтервалПовторныхУведомленийВДнях"].ТолькоПросмотр = НЕ (КонтрольАктивен И ОтправлятьПовторныеУведомления);
	Элементы[Префикс + "МаксимальноеКоличествоПовторов"].ТолькоПросмотр = НЕ (КонтрольАктивен И ОтправлятьПовторныеУведомления);
	
КонецПроцедуры 

#КонецОбласти
